In [1]:
import pandas as pd

## creating a dataset with duplicates

In [2]:
df = pd.DataFrame({
    'name': ['sammy', 'rockie', 'radan', 'emily','emily', 'sammy', 'sammy'],
    'sex': ['m', 'm', 'm', 'f', 'f', 'm', 'f'],
    'age': [21, 14, 42, 23, 23, 21, 23]
})
df

     name sex  age
0   sammy   m   21
1  rockie   m   14
2   radan   m   42
3   emily   f   23
4   emily   f   23
5   sammy   m   21
6   sammy   f   23

In [6]:
## even though two persons have the same name , their gender and age contradicts , hence they are not removed
## only when entire row is same , it returns a boolean as true
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
6    False
dtype: bool

In [9]:
new_df = df.drop_duplicates()
new_df

     name sex  age
0   sammy   m   21
1  rockie   m   14
2   radan   m   42
3   emily   f   23
6   sammy   f   23

In [28]:
new_df.reset_index()
new_df

     name sex  age
0   sammy   m   21
1  rockie   m   14
2   radan   m   42
3   emily   f   23
6   sammy   f   23

## similarly we can find duplicates only for a row or column , examples

In [10]:
df['age'].duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
6     True
Name: age, dtype: bool

In [29]:
age_df = df['age'].drop_duplicates()
age_df

0    21
1    14
2    42
3    23
Name: age, dtype: int64

### another example : removing duplicate names

In [27]:
df['name'].duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
6     True
Name: name, dtype: bool

In [30]:
name_df = df['name'].drop_duplicates()
name_df

0     sammy
1    rockie
2     radan
3     emily
Name: name, dtype: object

## some more useful codes

In [22]:
df.iloc[1]

name    rockie
sex          m
age         14
Name: 1, dtype: object

In [25]:
# to find the unique elements such as names, age etc;
## returns array with unique elements and not boolean unlike .duplicated method
df['name'].unique()

array(['sammy', 'rockie', 'radan', 'emily'], dtype=object)